---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexStream.Dispose
source: html/1a7b2093-a251-21ae-a225-1a456da5d73b.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexStream.Dispose Method

Releases all resources used by the IndexStream

## Syntax (C#)
```csharp
public void Dispose()
```